In [1]:
import numpy as np
import pandas as pd

In [3]:
sample_array = np.array([1,2,3,4,5])
sample_array

array([1, 2, 3, 4, 5])

In [5]:
sample_array + 2

array([3, 4, 5, 6, 7])

In [7]:
np.arange(start=1,stop=6,step=2)

array([1, 3, 5])

In [11]:
np.arange(1,10,0.2)

array([1. , 1.2, 1.4, 1.6, 1.8, 2. , 2.2, 2.4, 2.6, 2.8, 3. , 3.2, 3.4,
       3.6, 3.8, 4. , 4.2, 4.4, 4.6, 4.8, 5. , 5.2, 5.4, 5.6, 5.8, 6. ,
       6.2, 6.4, 6.6, 6.8, 7. , 7.2, 7.4, 7.6, 7.8, 8. , 8.2, 8.4, 8.6,
       8.8, 9. , 9.2, 9.4, 9.6, 9.8])

In [13]:
np.tile(0,4)

array([0, 0, 0, 0])

In [15]:
np.zeros(4)

array([0., 0., 0., 0.])

In [17]:
np.zeros([2,3])

array([[0., 0., 0.],
       [0., 0., 0.]])

In [19]:
np.ones([3,3])

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [21]:
d1_array = np.arange(1,10,1)

In [26]:
#スライシング
d1_array[1:3]

array([2, 3])

In [35]:
d2_array = np.array([[1,2,3,4],[5,6,7,8]])
d2_array[1,2:4]

array([7, 8])

In [37]:
df = pd.DataFrame({
    'col1':sample_array,
    'col2':sample_array*2,
    'col3':["A","B","C","D","E"]
})
df

   col1  col2 col3
0     1     2    A
1     2     4    B
2     3     6    C
3     4     8    D
4     5    10    E

In [39]:
df1 = pd.DataFrame({
    'col1':np.array([1,2,3]),
    'col2':np.array(["A","B","C"])
})
df2 = pd.DataFrame({
    'col1':np.array([1,2,3]),
    'col2':np.array(["D","E","F"])
})

In [41]:
df1

   col1 col2
0     1    A
1     2    B
2     3    C

In [43]:
df2

   col1 col2
0     1    D
1     2    E
2     3    F

In [48]:
pd.concat([df1,df2],axis=0)

   col1 col2
0     1    A
1     2    B
2     3    C
0     1    D
1     2    E
2     3    F

In [49]:
pd.concat([df1,df2],axis=1)

   col1 col2  col1 col2
0     1    A     1    D
1     2    B     2    E
2     3    C     3    F

In [51]:
df1.col1

0    1
1    2
2    3
Name: col1, dtype: int64

In [53]:
df1['col1']

0    1
1    2
2    3
Name: col1, dtype: int64

In [56]:
df1[['col1','col2']]

   col1 col2
0     1    A
1     2    B
2     3    C

In [60]:
df1.drop("col1",axis=1)

  col2
0    A
1    B
2    C

In [64]:
#indexを指定して,axis=0にすれば行を消せる
df1.drop(0,axis=0)

   col1 col2
1     2    B
2     3    C

In [67]:
df1.head(1)

   col1 col2
0     1    A

In [70]:
df1.query('col2=="B"')

   col1 col2
1     2    B

In [73]:
df1.query('col2=="B"|col2=="C"')

   col1 col2
1     2    B
2     3    C

In [82]:
df1.query('col2=="B" | col2=="C"')[["col1","col2"]]

   col1 col2
1     2    B
2     3    C

In [84]:
type(df1)

pandas.core.frame.DataFrame

In [86]:
type(df1['col1'])

pandas.core.series.Series

In [87]:
help(df1.query)

Help on method query in module pandas.core.frame:

query(expr, inplace=False, **kwargs) method of pandas.core.frame.DataFrame instance
    Query the columns of a DataFrame with a boolean expression.

    Parameters
    ----------
    expr : str
        The query string to evaluate.  You can refer to variables
        in the environment by prefixing them with an '@' character like
        ``@a + b``.

        .. versionadded:: 0.25.0

        You can refer to column names that contain spaces by surrounding
        them in backticks.

        For example, if one of your columns is called ``a a`` and you want
        to sum it with ``b``, your query should be ```a a` + b``.

    inplace : bool
        Whether the query should modify the data in place or return
        a modified copy.
    **kwargs
        See the documentation for :func:`eval` for complete details
        on the keyword arguments accepted by :meth:`DataFrame.query`.

        .. versionadded:: 0.18.0

    Returns
    -------
    DataFrame
        DataFrame resulting from the provided query expression.

    See Also
    --------
    eval : Evaluate a string describing operations on
        DataFrame columns.
    DataFrame.eval : Evaluate a string describing operations on
        DataFrame columns.

    Notes
    -----
    The result of the evaluation of this expression is first passed to
    :attr:`DataFrame.loc` and if that fails because of a
    multidimensional key (e.g., a DataFrame) then the result will be passed
    to :meth:`DataFrame.__getitem__`.

    This method uses the top-level :func:`eval` function to
    evaluate the passed query.

    The :meth:`~pandas.DataFrame.query` method uses a slightly
    modified Python syntax by default. For example, the ``&`` and ``|``
    (bitwise) operators have the precedence of their boolean cousins,
    :keyword:`and` and :keyword:`or`. This *is* syntactically valid Python,
    however the semantics are different.

    You can change the semantics of the expression by passing the keyword
    argument ``parser='python'``. This enforces the same semantics as
    evaluation in Python space. Likewise, you can pass ``engine='python'``
    to evaluate an expression using Python itself as a backend. This is not
    recommended as it is inefficient compared to using ``numexpr`` as the
    engine.

    The :attr:`DataFrame.index` and
    :attr:`DataFrame.columns` attributes of the
    :class:`~pandas.DataFrame` instance are placed in the query namespace
    by default, which allows you to treat both the index and columns of the
    frame as a column in the frame.
    The identifier ``index`` is used for the frame index; you can also
    use the name of the index to identify it in a query. Please note that
    Python keywords may not be used as identifiers.

    For further details and examples see the ``query`` documentation in
    :ref:`indexing <indexing.query>`.

    Examples
    --------
    >>> df = pd.DataFrame({'A': range(1, 6),
    ...                    'B': range(10, 0, -2),
    ...                    'C C': range(10, 5, -1)})
    >>> df
       A   B  C C
    0  1  10   10
    1  2   8    9
    2  3   6    8
    3  4   4    7
    4  5   2    6
    >>> df.query('A > B')
       A  B  C C
    4  5  2    6

    The previous expression is equivalent to

    >>> df[df.A > df.B]
       A  B  C C
    4  5  2    6

    For columns with spaces in their name, you can use backtick quoting.

    >>> df.query('B == `C C`')
       A   B  C C
    0  1  10   10

    The previous expression is equivalent to

    >>> df[df.B == df['C C']]
       A   B  C C
    0  1  10   10